groupmates = [
    {
        "name": "Александр",
        "surname": "Иванов",
        "exams": ["Информатика", "ЭЭиС", "Web"],
        "marks": [4, 3, 5]
    },
    {
        "name": "Иван",
        "surname": "Петров",
        "exams": ["История", "АиГ", "КТП"],
        "marks": [4, 4, 4]
    },
    {
        "name": "Кирилл",
        "surname": "Смирнов",
        "exams": ["Философия", "ИС", "КТП"],
        "marks": [5, 5, 5]
    },
    {
        "name": "Константин",
        "surname": "Тарасов",
        "exams": ["МСиП", "ИТП", "БЖД"],
        "marks": [5, 5, 5]
    },
    {
        "name": "Виталик",
        "surname": "Бутерин",
        "exams": ["Маркетинг", "История", "БЖД"],
        "marks": [3, 5, 5]
    }
]